[
    {
        "keywords": [
            "who are you",
            "what are you",
            "your identity",
            "about you"
        ],
        "content": "I am an AI-powered chatbot developed by Juned. I act as his virtual assistant and help users learn about his skills, projects, experience, and career journey."
    },
    {
        "keywords": [
            "are you juned",
            "is this juned",
            "are you a human"
        ],
        "content": "No, I am not Juned. I am an AI bot created by Juned to represent his portfolio, answer questions about his background, and showcase his work."
    },
    {
        "keywords": [
            "what do you do",
            "your purpose",
            "why were you created"
        ],
        "content": "I was created by Juned to serve as an interactive AI portfolio assistant that explains his resume, projects, skills, and experience in a conversational way."
    },
    {
        "keywords": [
            "tell me about juned",
            "who is juned",
            "about juned"
        ],
        "content": "Juned is a Full Stack Developer and AI Specialist based in Bengaluru, India. He works on MERN stack applications, AI systems, machine learning projects, and immersive 3D web experiences."
    },
    {
        "keywords": [
            "juned profession",
            "juned role",
            "what does juned do"
        ],
        "content": "Juned works as a Full Stack Developer and AI Engineer, building complete end-to-end systems that combine frontend development, backend APIs, AI models, and 3D interaction."
    },
    {
        "keywords": [
            "contact juned",
            "juned contact",
            "email",
            "phone"
        ],
        "content": "You can contact Juned via email at Muhammadjunaid8105@gmail.com or by phone at +91 8105238129. You can also find him on LinkedIn, GitHub, and YouTube."
    },
    {
        "keywords": [
            "where is juned from",
            "juned location",
            "based in"
        ],
        "content": "Juned is currently based in Bengaluru, India."
    },
    {
        "keywords": [
            "juned experience",
            "work experience",
            "career history"
        ],
        "content": "Juned has professional experience as a Full Stack Web Development Intern, AI & Robotics Master Trainer, TinkerLab Trainer Intern, and System Administrator Intern."
    },
    {
        "keywords": [
            "edunet internship",
            "mern internship"
        ],
        "content": "At Edunet Foundation, Juned worked as a Full Stack Web Development Intern, where he built an online auction platform using the MERN stack and optimized backend APIs."
    },
    {
        "keywords": [
            "agilo",
            "stempedia",
            "ai trainer experience"
        ],
        "content": "At Agilo Research (STEMpedia), Juned served as an AI & Robotics Master Trainer, conducting AI and robotics sessions, guiding students for CODEAVOUR competitions, and representing the organization at G20 events."
    },
    {
        "keywords": [
            "samarthanam",
            "tinkerlab"
        ],
        "content": "At Samarthanam Trust, Juned worked as a TinkerLab Trainer Intern, training teachers and students in Micro:bit, robotics, mobile app development, and 3D printing."
    },
    {
        "keywords": [
            "system administrator",
            "networking internship"
        ],
        "content": "Juned interned as a System Administrator at Universal Computer Sales & Services, where he handled networking, server configuration, and system troubleshooting."
    },
    {
        "keywords": [
            "juned projects",
            "portfolio projects"
        ],
        "content": "Juned has worked on several projects including an AI-powered 3D virtual tutor, real-time chatbot systems, deep learning applications, and full-stack MERN platforms."
    },
    {
        "keywords": [
            "ai guru j",
            "3d tutor",
            "virtual python teacher"
        ],
        "content": "AI Guru J is an intelligent 3D virtual Python tutor developed by Juned. It answers Python questions using an AI model, speaks using text-to-speech, and uses a lip-synced 3D avatar for interactive learning."
    },
    {
        "keywords": [
            "ai guru j tech stack",
            "ai guru j technologies"
        ],
        "content": "AI Guru J uses React, Three.js, FastAPI, a custom AI model with RAG architecture, speech recognition, text-to-speech, lip-sync animation, and MongoDB Atlas."
    },
    {
        "keywords": [
            "chatbot project",
            "real time chatbot"
        ],
        "content": "Juned developed a real-time chatbot application using React.js, Nhost, Hasura, and n8n, focusing on secure authentication and scalable messaging."
    },
    {
        "keywords": [
            "emotion recognition",
            "deep learning project"
        ],
        "content": "Juned built a Face Emotion Recognition system using TensorFlow, Keras, and OpenCV, training a convolutional neural network on the FER-2013 dataset."
    },
    {
        "keywords": [
            "auction platform",
            "mern auction project"
        ],
        "content": "Juned developed a full-stack Online Auction Platform using the MERN stack, supporting real-time bidding and user authentication."
    },
    {
        "keywords": [
            "juned education",
            "degree",
            "btech"
        ],
        "content": "Juned is pursuing a B.Tech in Computer Science and Engineering at M. S. Ramaiah University of Applied Sciences with a CGPA of 8.41."
    },
    {
        "keywords": [
            "juned diploma",
            "polytechnic"
        ],
        "content": "Before his degree, Juned completed a Diploma in Computer Science and Engineering from Dr. T. M. A. Pai Polytechnic, Manipal."
    },
    {
        "keywords": [
            "juned skills",
            "technical skills"
        ],
        "content": "Juned’s technical skills include Python, Java, C, HTML, CSS, JavaScript, React.js, Node.js, Express.js, MongoDB, MySQL, TensorFlow, OpenCV, NumPy, Pandas, Docker, GitHub, REST APIs, OOP, DSA, and AI/ML concepts."
    },
    {
        "keywords": [
            "ai skills",
            "machine learning skills"
        ],
        "content": "Juned has strong hands-on experience in AI and Machine Learning, including deep learning models, NLP-based chatbots, face emotion recognition, and AI-powered educational systems."
    },
    {
        "keywords": [
            "certifications",
            "courses"
        ],
        "content": "Juned has completed certifications in Generative AI, NoSQL & Big Data, Microsoft AI Classroom, MERN Stack development, and AI & Robotics."
    },
    {
        "keywords": [
            "juned achievements",
            "accomplishments"
        ],
        "content": "Juned’s achievements include training over 100 teachers in AI and robotics, building multiple AI-powered applications, and creating 3D and voice-enabled learning platforms."
    },
    {
        "keywords": [
            "career goal",
            "future plans"
        ],
        "content": "Juned’s career goal is to build scalable AI-driven systems and immersive learning platforms that combine artificial intelligence, software engineering, and 3D visualization."
    },
    {
        "keywords": [
            "why hire juned",
            "hire juned",
            "hire"
        ],
        "content": "Juned should be hired for his strong full stack and AI skills, real-world project experience, teaching background, and ability to deliver complete intelligent solutions."
    },
    {
        "keywords": [
            "hi",
            "hello",
            "hey"
        ],
        "content": "Hello! 👋 I’m an AI chatbot developed by Juned. How can I help you today?"
    },
    {
        "keywords": [
            "how are you",
            "what's up"
        ],
        "content": "I’m functioning perfectly and ready to assist you with information about Juned’s profile and projects."
    },
    {
        "keywords": [
            "thanks",
            "thank you"
        ],
        "content": "You’re welcome! 😊 I’m happy to help. Feel free to ask more about Juned."
    },
    {
        "keywords": [
            "bye",
            "goodbye",
            "see you"
        ],
        "content": "Goodbye! 👋 I’m always here if you want to explore Juned’s work again."
    },
    {
        "keywords": [
            "unknown",
            "not sure",
            "no idea"
        ],
        "content": "I don’t have information on that yet, but I can help you with Juned’s skills, projects, education, or experience."
    }
]